_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_Итоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НаименованиеЛимзатратыАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_ПрефиксыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_ПрефиксыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Определитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОтбрасыватьПрефикс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьЗаписиВСправочнике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрефикса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_СоответствияЛимЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_СоответствияЛимЗатрат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЛимЗатраты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЛимзатраты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЛимЗатрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеЛимзатратыАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_СоответствияШифров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_СоответствияШифров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_СметныеПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_СметныеПрограммы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ИндентификацияАРПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаИндентификации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_АРПС_ОбменВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет регистры АРПС из макета.
Процедура ЗаполнитьРегистры() Экспорт
	
	ИтогиАрпс  = Неопределено;
	Префиксы   = Неопределено;
	ЛимЗатраты = Неопределено;
	Шифры      = Неопределено;
	
	// СМ_АРПС_Итоги
	Попытка
		ИтогиАрпс = РегистрыСведений.СМ_АРПС_Итоги.ПолучитьМакет("СМ_АРПС_ПервоначальноеЗаполнениеРегистра"); 
	Исключение
		Событие = НСтр("ru = 'Исключение Смета обработчики АРПС (вызов сервера)'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	Если Не ИтогиАрпс = Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
		Для Стр=1 По ИтогиАрпс.ВысотаТаблицы Цикл
			НоваяСтрока=ТЗ.Добавить();
			Ячейка=ИтогиАрпс.Область(Стр, 1);
			НоваяСтрока.Наименование=СокрЛП(Ячейка.Текст);
		КонецЦикла;
		
		МенВрТаб = Новый МенеджерВременныхТаблиц;
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенВрТаб;
		Запрос.Текст = "ВЫБРАТЬ
		                |	ТЗ.Наименование
		                |ПОМЕСТИТЬ ВТИтоги
		                |ИЗ
		                |	&ТЗ КАК ТЗ
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	СМ_АРПС_Итоги.НаименованиеЛимзатратыАРПС КАК Наименование
		                |ПОМЕСТИТЬ ИтогиБД
		                |ИЗ
		                |	РегистрСведений.СМ_АРПС_Итоги КАК СМ_АРПС_Итоги
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	ВТИтоги.Наименование
		                |ИЗ
		                |	ВТИтоги КАК ВТИтоги
		                |ГДЕ
		                |	НЕ ВТИтоги.Наименование В
		                |				(ВЫБРАТЬ
		                |					ИтогиБД.Наименование
		                |				ИЗ
		                |					ИтогиБД КАК ИтогиБД)";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для каждого стр Из ТЗ Цикл
			РС_Итоги = РегистрыСведений.СМ_АРПС_Итоги.СоздатьМенеджерЗаписи();
			РС_Итоги.НаименованиеЛимзатратыАРПС = стр.Наименование;
			РС_Итоги.РедактироваласьПользователем = Ложь;
			РС_Итоги.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
    // СМ_АРПС_ПрефиксыОбъектов
	Попытка
		Префиксы = РегистрыСведений.СМ_АРПС_ПрефиксыОбъектов.ПолучитьМакет("СМ_АРПС_ПервоначальноеЗаполнениеРегистра"); 
	Исключение
		Событие = НСтр("ru = 'Исключение Смета обработчики АРПС (вызов сервера)'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	Если Не Префиксы = Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		ТЗ.Колонки.Добавить("СметнаяПрограмма");
		ТЗ.Колонки.Добавить("СтрокаПрефикса");
		ТЗ.Колонки.Добавить("ТипНормативногоСборника");
		ТЗ.Колонки.Добавить("Определитель");
		ТЗ.Колонки.Добавить("ВидРесурса");
		Для Стр=1 По Префиксы.ВысотаТаблицы Цикл
			НоваяСтрока=ТЗ.Добавить();
			НоваяСтрока.СметнаяПрограмма=СокрЛП(Префиксы.Область(Стр, 1).Текст);
			НоваяСтрока.СтрокаПрефикса=СокрЛП(Префиксы.Область(Стр, 2).Текст);
			НоваяСтрока.ТипНормативногоСборника=СокрЛП(Префиксы.Область(Стр, 3).Текст);
			НоваяСтрока.Определитель=СокрЛП(Префиксы.Область(Стр, 4).Текст);
			НоваяСтрока.ВидРесурса=СокрЛП(Префиксы.Область(Стр, 5).Текст);
		КонецЦикла;
		ТЗПрограмм = ТЗ.Скопировать(,"СметнаяПрограмма");
		ЗаполнитьИдПрограмм(ТЗПрограмм,ТЗ);  
		Для каждого стр Из ТЗ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СМ_АРПС_ПрефиксыОбъектов.СметнаяПрограмма,
			               |	СМ_АРПС_ПрефиксыОбъектов.РедактироваласьПользователем
			               |ИЗ
			               |	РегистрСведений.СМ_АРПС_ПрефиксыОбъектов КАК СМ_АРПС_ПрефиксыОбъектов
			               |ГДЕ
			               |	СМ_АРПС_ПрефиксыОбъектов.СметнаяПрограмма = &Прог
			               |	И СМ_АРПС_ПрефиксыОбъектов.СтрокаПрефикса = &Преф";
			Запрос.УстановитьПараметр("Прог",стр.СметнаяПрограмма);
			Запрос.УстановитьПараметр("Преф",стр.СтрокаПрефикса);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.РедактироваласьПользователем Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			РС_Префиксы = РегистрыСведений.СМ_АРПС_ПрефиксыОбъектов.СоздатьМенеджерЗаписи();
			РС_Префиксы.СметнаяПрограмма = стр.СметнаяПрограмма;
			РС_Префиксы.СтрокаПрефикса = стр.СтрокаПрефикса;
			Если ЗначениеЗаполнено (стр.ТипНормативногоСборника) Тогда
				РС_Префиксы.ТипНормативногоСборника = Перечисления.СМ_ТипыНормативныхСборников[стр.ТипНормативногоСборника];
			КонецЕсли;
			Если ЗначениеЗаполнено (стр.Определитель) Тогда
				РС_Префиксы.Определитель =  Справочники.СМ_Определители.НайтиПоКоду(стр.Определитель);
			КонецЕсли;
			РС_Префиксы.РедактироваласьПользователем = Ложь;
			Если ЗначениеЗаполнено(стр.ВидРесурса) Тогда
				РС_Префиксы.ВидРесурса = Перечисления.СМ_ВидыРесурсов[стр.ВидРесурса];
			КонецЕсли;
			РС_Префиксы.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
	// СМ_АРПС_СоответствияЛимЗатрат
	Попытка
		ЛимЗатраты = РегистрыСведений.СМ_АРПС_СоответствияЛимЗатрат.ПолучитьМакет("СМ_АРПС_ПервоначальноеЗаполнениеРегистра"); 
	Исключение
		Событие = НСтр("ru = 'Исключение Смета обработчики АРПС (вызов сервера)'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	Если Не ЛимЗатраты = Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		ТЗ.Колонки.Добавить("СметнаяПрограмма");
		ТЗ.Колонки.Добавить("НаименованиеЛимзатратыАРПС");
		ТЗ.Колонки.Добавить("ИдентификаторЛимЗатраты");
		ТЗ.Колонки.Добавить("ЛимЗатрата");
		Для Стр=1 По ЛимЗатраты.ВысотаТаблицы Цикл
			НоваяСтрока=ТЗ.Добавить();
			НоваяСтрока.СметнаяПрограмма=СокрЛП(ЛимЗатраты.Область(Стр, 1).Текст);
			НоваяСтрока.НаименованиеЛимзатратыАРПС=СокрЛП(ЛимЗатраты.Область(Стр, 2).Текст);
			НоваяСтрока.ИдентификаторЛимЗатраты=СокрЛП(ЛимЗатраты.Область(Стр, 3).Текст);
			НоваяСтрока.ЛимЗатрата=СокрЛП(ЛимЗатраты.Область(Стр, 4).Текст);
		КонецЦикла;
		ТЗПрограмм = ТЗ.Скопировать(,"СметнаяПрограмма");
		ЗаполнитьИдПрограмм(ТЗПрограмм,ТЗ);
		Для каждого стр Из ТЗ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СМ_АРПС_СоответствияЛимЗатрат.СметнаяПрограмма,
			|	СМ_АРПС_СоответствияЛимЗатрат.РедактироваласьПользователем
			|ИЗ
			|	РегистрСведений.СМ_АРПС_СоответствияЛимЗатрат КАК СМ_АРПС_СоответствияЛимЗатрат
			|ГДЕ
			|	СМ_АРПС_СоответствияЛимЗатрат.СметнаяПрограмма = &Прог
			|	И СМ_АРПС_СоответствияЛимЗатрат.НаименованиеЛимзатратыАРПС = &ЛимЗатрата";
			Запрос.УстановитьПараметр("Прог",стр.СметнаяПрограмма);
			Запрос.УстановитьПараметр("ЛимЗатрата",стр.НаименованиеЛимзатратыАРПС);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.РедактироваласьПользователем Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			РС_ЛимЗатрат = РегистрыСведений.СМ_АРПС_СоответствияЛимЗатрат.СоздатьМенеджерЗаписи();
			РС_ЛимЗатрат.СметнаяПрограмма = стр.СметнаяПрограмма;
			РС_ЛимЗатрат.НаименованиеЛимзатратыАРПС = стр.НаименованиеЛимзатратыАРПС;
			РС_ЛимЗатрат.ИдентификаторЛимЗатраты = стр.ИдентификаторЛимЗатраты;
			РС_ЛимЗатрат.ЛимЗатрата =  Справочники.СМ_ЛимитированныеЗатраты.НайтиПоРеквизиту("Идентификатор",стр.ИдентификаторЛимЗатраты);
			РС_ЛимЗатрат.НаименованиеЛимзатраты =  стр.ЛимЗатрата;;
			РС_ЛимЗатрат.РедактироваласьПользователем = Ложь;
			РС_ЛимЗатрат.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
	// СМ_АРПС_СоответствияШифров
	Попытка
		Шифры = РегистрыСведений.СМ_АРПС_СоответствияШифров.ПолучитьМакет("СМ_АРПС_ПервоначальноеЗаполнениеРегистра"); 
	Исключение
		Событие = НСтр("ru = 'Исключение Смета обработчики АРПС (вызов сервера)'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	Если Не Шифры = Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		ТЗ.Колонки.Добавить("СметнаяПрограмма");
		ТЗ.Колонки.Добавить("ШифрАРПС");
		ТЗ.Колонки.Добавить("Шифр");
		ТЗ.Колонки.Добавить("Ресурс");
		Для Стр=1 По Шифры.ВысотаТаблицы Цикл
			НоваяСтрока=ТЗ.Добавить();
			НоваяСтрока.СметнаяПрограмма=СокрЛП(Шифры.Область(Стр, 1).Текст);
			НоваяСтрока.ШифрАРПС=СокрЛП(Шифры.Область(Стр, 2).Текст);
			НоваяСтрока.Шифр=СокрЛП(Шифры.Область(Стр, 3).Текст);
			НоваяСтрока.Ресурс=СокрЛП(Шифры.Область(Стр, 4).Текст);
		КонецЦикла;
		ТЗПрограмм = ТЗ.Скопировать(,"СметнаяПрограмма");
		ЗаполнитьИдПрограмм(ТЗПрограмм,ТЗ);
		Для каждого стр Из ТЗ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СМ_АРПС_СоответствияШифров.СметнаяПрограмма,
			|	СМ_АРПС_СоответствияШифров.РедактироваласьПользователем
			|ИЗ
			|	РегистрСведений.СМ_АРПС_СоответствияШифров КАК СМ_АРПС_СоответствияШифров
			|ГДЕ
			|	СМ_АРПС_СоответствияШифров.СметнаяПрограмма = &Прог
			|	И СМ_АРПС_СоответствияШифров.ШифрАРПС = &Шифр";
			Запрос.УстановитьПараметр("Прог",стр.СметнаяПрограмма);
			Запрос.УстановитьПараметр("Шифр",стр.ШифрАРПС);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.РедактироваласьПользователем Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			РС_Шифр = РегистрыСведений.СМ_АРПС_СоответствияШифров.СоздатьМенеджерЗаписи();
			РС_Шифр.СметнаяПрограмма = стр.СметнаяПрограмма;
			РС_Шифр.ШифрАРПС = стр.ШифрАРПС;
			РС_Шифр.Шифр = стр.Шифр;
			РС_Шифр.Ресурс =  Справочники.СМ_Ресурсы.НайтиПоКоду(стр.Шифр);
			РС_Шифр.РедактироваласьПользователем = Ложь;
			РС_Шифр.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Загружает идентифкаторы АРПС из макета.
Процедура ЗагрузитьИдентификаторыПрограмм() Экспорт
    Попытка
		СметныеПрограммы = Справочники.СМ_СметныеПрограммы.ПолучитьМакет("СметныеПрограммы"); 
	Исключение
		Событие = НСтр("ru = 'Исключение Смета обработчики АРПС (вызов сервера)'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	
	Если Не СметныеПрограммы = Неопределено Тогда
		
		Для Стр=1 По СметныеПрограммы.ВысотаТаблицы Цикл
			УжеИмеется = ПолучитьПрограмму(СокрЛП(СметныеПрограммы.Область(Стр, 2).Текст));
			Если Не ЗначениеЗаполнено(УжеИмеется) Тогда
			 	Программа = Справочники.СМ_СметныеПрограммы[СокрЛП(СметныеПрограммы.Область(Стр, 1).Текст)].ПолучитьОбъект();
				СтрокаИД = Программа.ИндентификацияАРПС.Добавить();
				СтрокаИД.СтрокаИндентификации = СокрЛП(СметныеПрограммы.Область(Стр, 2).Текст);
				Программа.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает сметную программу по ее идентифкатору.
//
// Параметры:
//     НаименованиеПрограммы - Строка - идентификатор программы.
// 
// Возвращаемое значение:
//     СправочникСсылка.СМ_СметныеПрограммы - найденная программа или пустая ссылка.
//
Функция ПолучитьПрограмму(НаименованиеПрограммы) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_СметныеПрограммыИндентификацияАРПС.Ссылка
	               |ИЗ
	               |	Справочник.СМ_СметныеПрограммы.ИндентификацияАРПС КАК СМ_СметныеПрограммыИндентификацияАРПС
	               |ГДЕ
	               |	СМ_СметныеПрограммыИндентификацияАРПС.СтрокаИндентификации ПОДОБНО &Программа";
	Запрос.УстановитьПараметр("Программа",НаименованиеПрограммы);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.СМ_СметныеПрограммы.ПустаяСсылка();
	КонецЕсли;
КонецФункции

// Возвращает префиксы сметной программы.
//
// Параметры:
//     СметнаяПрограмма - СправочникСсылка.СМ_СметныеПрограммы - сметная программа, для получения префиксов.
// 
// Возвращаемое значение:
//     ПрефиксыПрограммы - ТаблицаЗначений - содержит префиксы программы.
//
Функция ПолучитьПрефиксы(СметнаяПрограмма) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СМ_АРПС_ПрефиксыОбъектов.СтрокаПрефикса КАК Префикс,
	               |	СМ_АРПС_ПрефиксыОбъектов.ТипНормативногоСборника КАК ТНС,
	               |	СМ_АРПС_ПрефиксыОбъектов.Определитель,
	               |	СМ_АРПС_ПрефиксыОбъектов.ВидРесурса,
	               |	СМ_АРПС_ПрефиксыОбъектов.НеОтбрасыватьПрефикс,
	               |	СМ_АРПС_ПрефиксыОбъектов.СоздаватьЗаписиВСправочнике
	               |ИЗ
	               |	РегистрСведений.СМ_АРПС_ПрефиксыОбъектов КАК СМ_АРПС_ПрефиксыОбъектов
	               |ГДЕ
	               |	СМ_АРПС_ПрефиксыОбъектов.СметнаяПрограмма = &СметнаяПрограмма";
	Запрос.УстановитьПараметр("СметнаяПрограмма",СметнаяПрограмма);
    ПрефиксыПрограммы = Запрос.Выполнить().Выгрузить();
	ПрефиксыПрограммы.Колонки.Добавить("ДлинаСтроки");
	Для Каждого стр Из ПрефиксыПрограммы Цикл
		стр.ДлинаСтроки = СтрДлина(стр.Префикс);
	КонецЦикла;
	ПрефиксыПрограммы.Сортировать("ДлинаСтроки Убыв");
	Возврат ПрефиксыПрограммы;
КонецФункции	

// Возвращает строку с нужным префиксом.
//
// Параметры:
//     ШифрПозиции 			- Строка - шифр из файла.
//     ПрефиксыПрограммы 	- ТаблицаЗначений - содержит префиксы программы.
// Возвращаемое значение:
//     СтруктураДанных - Структура - содержит показатели.
//
Функция НайтиСтрокуПоПрефиксу(ШифрПозиции,ПрефиксыПрограммы) Экспорт
	СтруктураДанных = Неопределено;
	Для Каждого Преф Из ПрефиксыПрограммы Цикл
		Если НЕ ПустаяСтрока(Преф.Префикс) Тогда
			Если ВРег(ШифрПозиции) = ВРег(Преф.Префикс) Тогда
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ШифрБезПрефикса","");
				СтруктураДанных.Вставить("Префикс",Преф.Префикс);
				СтруктураДанных.Вставить("ТНС",Преф.ТНС);
				СтруктураДанных.Вставить("Определитель",Преф.Определитель);
				СтруктураДанных.Вставить("ВидРесурса",Преф.ВидРесурса);
				СтруктураДанных.Вставить("НеОтбрасыватьПрефикс",Преф.НеОтбрасыватьПрефикс);
				СтруктураДанных.Вставить("СоздаватьЗаписиВСправочнике",Преф.СоздаватьЗаписиВСправочнике);
				Прервать;
			//Иначе
			//	Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Найти(Преф.Префикс,"%")>0 ИЛИ Найти(Преф.Префикс,"*")>0 Тогда
			ШифрБезПрефикса = "";
			СоответствуетМаске = ПодходитПоМаске(ШифрПозиции,Преф.Префикс,ШифрБезПрефикса);
			Если СоответствуетМаске Тогда
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ШифрБезПрефикса",ШифрБезПрефикса);
				СтруктураДанных.Вставить("Префикс",Преф.Префикс);
				СтруктураДанных.Вставить("ТНС",Преф.ТНС);
				СтруктураДанных.Вставить("Определитель",Преф.Определитель);
				СтруктураДанных.Вставить("ВидРесурса",Преф.ВидРесурса);
				СтруктураДанных.Вставить("НеОтбрасыватьПрефикс",Преф.НеОтбрасыватьПрефикс);
				СтруктураДанных.Вставить("СоздаватьЗаписиВСправочнике",Преф.СоздаватьЗаписиВСправочнике);
				Прервать
			КонецЕсли;
		Иначе	
			ПозицияПрефикса = Найти(Врег(ШифрПозиции),Врег(Преф.Префикс));
			Если ПозицияПрефикса>0 Тогда
				ШифрБезПрефикса = Сред(ШифрПозиции,СтрДлина(Преф.Префикс)+1);
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ШифрБезПрефикса",ШифрБезПрефикса);
				СтруктураДанных.Вставить("Префикс",Преф.Префикс);
				СтруктураДанных.Вставить("ТНС",Преф.ТНС);
				СтруктураДанных.Вставить("Определитель",Преф.Определитель);
				СтруктураДанных.Вставить("ВидРесурса",Преф.ВидРесурса);
				СтруктураДанных.Вставить("НеОтбрасыватьПрефикс",Преф.НеОтбрасыватьПрефикс);
				СтруктураДанных.Вставить("СоздаватьЗаписиВСправочнике",Преф.СоздаватьЗаписиВСправочнике);
				Прервать
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СтруктураДанных;
КонецФункции

// Возвращает признак того, что шифр содержит заданный шаблон префикса.
//
// Параметры:
//     ШифрПозиции 		- Строка - шифр из файла.
//     Маска 			- Строка - шаблон префикса.
//     ШифрБезПрефикса 	- Строка - через данный параметр передаётся шифр позиции без префикса.
// Возвращаемое значение:
//     Булево - Истина - шифр подходит по маске, Ложь - не подходит.
//
Функция ПодходитПоМаске(ШифрПозиции,Маска,ШифрБезПрефикса) Экспорт
	КолСиволов = СтрДлина(Маска);
	сч = 1;
	МаскаРег = "";
	Пока сч <= КолСиволов Цикл
		Символ = Сред(Маска,сч,1);
		Если Символ="%" Тогда
			МаскаРег = МаскаРег+Строка(".");
		ИначеЕсли Символ="*" Тогда
			МаскаРег = МаскаРег+Строка(".*");
		Иначе
			МаскаРег = МаскаРег+Строка(Символ);
		КонецЕсли;
		сч = сч+1;
	КонецЦикла;	
	МаскаРег = МаскаРег+Строка(".*"); 	
	
	Шаблон = МаскаРег; // регулярное выражение соответствует маске префикса.
	
	СтрокаШифра = ШифрПозиции; // проверяемый шифр.
	
	RegExp = Новый COMОбъект("VBScript.RegExp"); // создаем объект для работы  с регулярными выражениями.
	RegExp.MultiLine = Ложь;    // истина — текст многострочный, ложь — одна строка.
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения.
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске.
	RegExp.Pattern = Шаблон;    // шаблон (регулярное выражение) для проверки  шифра по маске.
	Если RegExp.Test(СтрокаШифра) Тогда // проверяем на соответствие маске.
		сч = 1;
		МаскаРег = "";
		Пока сч <= КолСиволов Цикл
			Символ = Сред(Маска,сч,1);
			Если Символ="%" Тогда
				МаскаРег = МаскаРег+Строка(".");
			ИначеЕсли Символ="*" Тогда
				МаскаРег = МаскаРег+Строка(".*");
			Иначе
				МаскаРег = МаскаРег+Строка(Символ);
			КонецЕсли;
			сч = сч+1;
		КонецЦикла;	
		МаскаРег = МаскаРег+Строка("(.*)"); 	
		Шаблон = МаскаРег; 
		
		RegExp.Pattern = Шаблон;
		Matches = RegExp.Execute(СтрокаШифра); // вычленяем шифр без префикса.
		Match = Matches.Item(0);
		Результат = Match.Value; 
		Submatches = Match.Submatches;
		ШифрБезПрефикса = СокрЛП(Submatches.Item(0));
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;   
	
КонецФункции

// Возвращает ресурс из регистра соответствия по шифру и сметной программе.
// Также заменяет код ресурса из файла на код из базы.
//
// Параметры:
//     СметнаяПрограмма - СправочникСсылка.СМ_СметныеПрограммы - сметная программа.
//     НоваяСтрока 		- Строка - содержит КодРесурса.
// Возвращаемое значение:
//     Ресурс, Неопределено - результат поиска ресурса АРПС.
//
Функция НайтиРесурсАРПС(СметнаяПрограмма,НоваяСтрока) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_АРПС_СоответствияШифров.Ресурс,
	               |	СМ_АРПС_СоответствияШифров.Шифр
	               |ИЗ
	               |	РегистрСведений.СМ_АРПС_СоответствияШифров КАК СМ_АРПС_СоответствияШифров
	               |ГДЕ
	               |	СМ_АРПС_СоответствияШифров.СметнаяПрограмма = &СметнаяПрограмма
	               |	И СМ_АРПС_СоответствияШифров.ШифрАРПС = &КодРесурса";
	Запрос.УстановитьПараметр("КодРесурса",НоваяСтрока.КодРесурса);
	Запрос.УстановитьПараметр("СметнаяПрограмма",СметнаяПрограмма);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока.КодРесурса = Выборка.Шифр;
		Возврат ?(Выборка.Ресурс.Пустая(),Неопределено,Выборка.Ресурс);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возврашает признак того пропускаем данную лимитированную затрату или нет.
//
// Параметры:
//     ЛимЗатрата - Строка - наименование лимитированной затраты.
// Возвращаемое значение:
//     Булево - Истина - Пропускаем затрату, Ложь - не пропускаем.
//
Функция ПолучитьПропускаемуюЛимЗатрату(ЛимЗатрата) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_АРПС_Итоги.НаименованиеЛимзатратыАРПС
	               |ИЗ
	               |	РегистрСведений.СМ_АРПС_Итоги КАК СМ_АРПС_Итоги
	               |ГДЕ
	               |	СМ_АРПС_Итоги.НаименованиеЛимзатратыАРПС = &ЛимЗатрата";
	Запрос.УстановитьПараметр("ЛимЗатрата",ЛимЗатрата);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Возврашает найденную по соответствиям лимитированную затрату.
//
// Параметры:
//     СметнаяПрограмма - СправочникСсылка.СМ_СметныеПрограммы - сметная программа.
//     ЛимЗатрата 		- Строка - наименование лимитированной затраты.
// Возвращаемое значение:
//     Справочники.СМ_ЛимитированныеЗатраты, Неопределено - результат получения лим. затраты.
//
Функция ПолучитьЛимЗатрату(СметнаяПрограмма,ЛимЗатрата) Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СМ_АРПС_СоответствияЛимЗатрат.ИдентификаторЛимЗатраты,
	|	СМ_АРПС_СоответствияЛимЗатрат.НаименованиеЛимзатраты,
	|	СМ_АРПС_СоответствияЛимЗатрат.ЛимЗатрата
	|ИЗ
	|	РегистрСведений.СМ_АРПС_СоответствияЛимЗатрат КАК СМ_АРПС_СоответствияЛимЗатрат
	|ГДЕ
	|	СМ_АРПС_СоответствияЛимЗатрат.СметнаяПрограмма = &СметнаяПрограмма
	|	И СМ_АРПС_СоответствияЛимЗатрат.НаименованиеЛимзатратыАРПС = &ЛимЗатрата";
	Запрос.УстановитьПараметр("ЛимЗатрата",ЛимЗатрата);
	Запрос.УстановитьПараметр("СметнаяПрограмма",СметнаяПрограмма);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЛимЗатратаСсылка = Выборка.ЛимЗатрата;
		Если ЛимЗатратаСсылка.Пустая() Тогда
			ЛимЗатратаСсылка = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоРеквизиту("Идентификатор",Выборка.ИдентификаторЛимЗатраты);
		КонецЕсли;
		Возврат ?(ЛимЗатратаСсылка.Пустая(),Неопределено,ЛимЗатратаСсылка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возврашает префикс.
//
// Параметры:
//     ПолныйШифр - Строка - шифр из файла.
// Возвращаемое значение:
//     Префикс - Строка - префикс полученный из строки.
//
Функция ПолучитьПрефиксИзСтроки(ПолныйШифр) Экспорт
	ЧислоСимволов = СтрДлина(ПолныйШифр);
	Префикс = "";
	Для сч=1 По ЧислоСимволов Цикл
		Символ = Сред(ПолныйШифр,сч,1);
		Если Найти(" -.+",Символ)>0 Тогда
			Префикс = Префикс+Символ;
		Иначе
			Попытка
				ЧислоШифра = Число(Символ);
				Прервать;
			Исключение
				Префикс = Префикс+Символ;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Возврат Префикс;
КонецФункции

// Заполняет ИД программ из макета.
//
// Параметры:
//     ТЗПрограмм - ТаблицаЗначений со всеми программами.
//     ТЗ - ТаблицаЗначений с идентификаторами программ.
//
Процедура ЗаполнитьИдПрограмм(ТЗПрограмм,ТЗ)
	ТЗПрограмм.Свернуть("СметнаяПрограмма");
	Для каждого прог Из ТЗПрограмм Цикл
		СметПрог = ПолучитьПрограмму(прог.СметнаяПрограмма);
		Если Не ЗначениеЗаполнено(СметПрог) Тогда
			Продолжить;
		КонецЕсли;
		СтрПрог = СметПрог.ИндентификацияАРПС.Найти(прог.СметнаяПрограмма,"СтрокаИндентификации");
		Если СтрПрог = Неопределено Тогда
			СметПрогОб = СметПрог.ПолучитьОбъект();
			СтрПрог = СметПрогОб.ИндентификацияАРПС.Добавить();
			СтрПрог.СтрокаИндентификации = прог.СметнаяПрограмма;
			СметПрогОб.ОбменДанными.Загрузка = Истина;
			СметПрогОб.Записать();
		КонецЕсли;
		Отбор = Новый Структура("СметнаяПрограмма",прог.СметнаяПрограмма);
		МассивПрог = ТЗ.НайтиСтроки(Отбор);
		Для каждого эл Из МассивПрог Цикл
			эл.СметнаяПрограмма = СметПрог;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизиты объекта данными из настроек пользователя (значениями по умолчанию).
//
// Параметры:
//     ТекОбъект - ДокументОбъект - объект, реквизиты которого заполняются.
//     Форма 	 - УправляемаяФорма - контекст формы обработки.
//
Процедура ЗаполнитьНастройкиПользователяПоУмолчанию(ТекОбъект, Форма) Экспорт
	
	Форма.ТекСтройка 			= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяСтройка");
	ТекОбъект.Организация 		= СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(Форма.ТекСтройка,"ОсновнаяОрганизация");	
	ТекОбъект.Район 			= СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(Форма.ТекСтройка,"ОсновнойРайон");	
	Форма.СметноНормативнаяБаза = Справочники.СМ_СметноНормативныеБазы.ПолучитьПоРайону(ТекОбъект.Район);
	Форма.ИзФайла 				= Истина;
	
КонецПроцедуры

// Процедура заполняет реквизиты локальной сметы из настроек пользователя (значениями по умолчанию).
//
// Параметры:
//     ТекОбъект - ДокументОбъект - объект, реквизиты которого заполняются.
//
Процедура ЗаполнитьИзНастроекПользователяПоУмолчанию(ТекОбъект) Экспорт
	
	ТекОбъект.МетодРасчета 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойМетодСчета");	
	ТекОбъект.ТипРайона 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ТипРайона");	
	ТекОбъект.ТипСтроительства 			= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойТипСтроительства");	
	ТекОбъект.Уровень 					= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","УровеньПримененияИндексов");	
	ТекОбъект.СпособРасчетаИндексов 	= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","СпособРасчетаИндексов");	
	ТекОбъект.ВариантПересчетаЭММ		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ВариантПересчетаЭММ");	
	ТекОбъект.ВариантРасчетаЗМ 			= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ВариантРасчетаЗМ");	
	ТекОбъект.СпособРасчетаИндексов 	= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","СпособРасчетаИндексов");	
	ТекОбъект.ОкруглятьДоРублей 		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОкруглятьИтоговуюСтоимостьДоРублей");	
	ТекОбъект.ОбрабатыватьПогрешность 	= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОбрабатыватьПогрешность");	
	
КонецПроцедуры

#КонецОбласти
